rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
  if (setpointPending) {
    snprintf(row0, sizeof(row0), "SP:%-4.2f*->%-4.2f", setpointSpeed, pendingSetpoint);
  } else {
    snprintf(row0, sizeof(row0), "SP:%-4.2f V:%-4.2f", setpointSpeed, currentLinearSpeedMs);
  }
    lcd->setCursor(1, 0);
  lcd->print(row0);

  snprintf(row1, sizeof(row1), "PWM:%-4d I:%-4.2fA", (int)round(pidOutput), cachedCurrent);
    lcd->setCursor(1, 1);
  lcd->print(row1);
}

// ============================================================
// 23. DEBUG SERIAL
// ============================================================
void debugSerial() {
  if (millis() - lastDebugTime < DEBUG_INTERVAL) return;
  lastDebugTime = millis();
  Serial.printf("[STATS] Vel:%.3f m/s SP:%.3f PWM:%.0f Cur:%.2fA Pending:%s PID:%s\n",
    currentLinearSpeedMs, setpointSpeed, pidOutput, cachedCurrent,
    setpointPending ? "YES" : "NO",
    (myPID.GetMode() == (uint8_t)QuickPID::Control::automatic) ? "AUTO" : "MANUAL");
}

// ============================================================
// 24. SETUP
// ============================================================
void setup() {
  Serial.begin(115200);
  Serial.println("\n[BOOT] Trotadora PID v9.8");

  // Motor
  pinMode(MOTOR_IN1_PIN, OUTPUT);
  pinMode(MOTOR_IN2_PIN, OUTPUT);
  motorParadaLibre();

#if ESP_IDF_VERSION_MAJOR >= 5
  ledcAttach(MOTOR_PWM_PIN, PWM_FREQUENCY, PWM_RESOLUTION);
  ledcWrite(MOTOR_PWM_PIN, 0);
#else
  ledcSetup(PWM_CHANNEL, PWM_FREQUENCY, PWM_RESOLUTION);
  ledcAttachPin(MOTOR_PWM_PIN, PWM_CHANNEL);
  ledcWrite(PWM_CHANNEL, 0);
#endif

  pinMode(MOTOR_CS_PIN,   INPUT);
  pinMode(LED_BUILTIN_PIN, OUTPUT);
  digitalWrite(LED_BUILTIN_PIN, LOW);

  // Hall
  pinMode(HALL_SENSOR_PIN, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(HALL_SENSOR_PIN), ISR_SensorHall, FALLING);

  // Encoder
  ESP32Encoder::useInternalWeakPullResistors = puType::up;
  encoder.attachHalfQuad(ENCODER_DT_PIN, ENCODER_CLK_PIN);
  encoder.clearCount();
  encoder.setFilter(1023);

  lastStableCount     = 0;
  lastStableTime      = millis();
  displayEncoderCount = 0;
  pendingSetpoint     = 0.0f;
  setpointPending     = false;

  Serial.println("[ENCODER] Inicializado — HALF_QUAD");

  // Botón del encoder
  pinMode(ENCODER_SW_PIN, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(ENCODER_SW_PIN), ISR_EncoderBoton, FALLING);

  // Emergencia
  pinMode(EMERGENCY_STOP_PIN, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(EMERGENCY_STOP_PIN), ISR_EmergencyStop, FALLING);

  // PID — arranca en MANUAL, límites neutros
  // El motor NO recibirá PWM hasta que se confirme un setpoint > 0
  myPID.SetOutputLimits(0, PID_OUTPUT_MAX);
  myPID.SetSampleTimeUs(CONTROL_INTERVAL_MS * 1000UL);  // <-- NUEVO: Configurar sample time
  myPID.SetTunings(50.0f, 8.0f, 0.0f);                  // <-- NUEVO: Re-escala Ki/Kd con período correcto
  myPID.SetMode(QuickPID::Control::manual);
  pidOutput = 0.0f;
  Serial.println("[PID] Modo MANUAL al inicio — esperando setpoint");

  // LCD
  initLCD();
  if (lcd) {
    lcd->setCursor(1, 0); lcd->print("TROTADORA v9.8");
    lcd->setCursor(1, 1); lcd->print("LABSENS");
    delay(1500);
    lcd->clear();
  }

  // WiFi AP
  WiFi.mode(WIFI_AP);
  WiFi.softAP(ssid, apPassword);
  Serial.printf("[WiFi] AP: %s | IP: %s\n",
                ssid, WiFi.softAPIP().toString().c_str());

  // WebSocket + HTTP
  ws.onEvent(onWebSocketEvent);
  server.addHandler(&ws);
  setupHTTPEndpoints();
  server.begin();
  Serial.println("[HTTP] Servidor iniciado");

  Serial.printf("[INFO] Rodillo Ø%.1fmm | %d imanes | PWM_MIN:%d PWM_MAX:%d\n",
                DRIVE_ROLLER_DIAMETER_MM, MAGNETS_COUNT,
                PID_OUTPUT_MIN, PID_OUTPUT_MAX);
  Serial.println("[INFO] Comandos: SET SP <m/s> | GET VEL | GET ENC | RESET ENC | GET CUR | STOP | TUNE <Kp Ki Kd>");
  Serial.println("[INFO] Encoder: Gira para ajustar setpoint temporal, presiona para CONFIRMAR");
  Serial.printf("[INFO] Log crudo imán por imán: hasta %d muestras por broadcast (%lu ms)\n",
                PULSE_LOG_SIZE, WS_SEND_INTERVAL);
}

// ============================================================
// 25. LOOP PRINCIPAL
// ============================================================
void loop() {
  unsigned long ahora = millis();

  // Emergencia
  if (emergencyStopTriggered) {
    if (!emergencyStopPending) {
      motorStop();
      Serial.println("[EMERGENCIA] ¡Motor detenido!");
      broadcastState();
      emergencyStopPending  = true;
      lastEmergencyDebounce = ahora;
    } else if (ahora - lastEmergencyDebounce >= EMERGENCY_DEBOUNCE_MS) {
      emergencyStopTriggered = false;
      emergencyStopPending   = false;
    }
  }

  // Entradas
  procesarEntradasEncoder();
  leerSerial();

  // Control PID - AHORA SIN GATE MANUAL
  // calculateSpeed siempre actualiza la medición
  calculateSpeed();
  
  // Compute decide si es momento de calcular según sample time configurado
  myPID.Compute();
  
  // Aplicar PWM siempre (PID en manual o automático)
  applyPWM((int)round(pidOutput));

  updateCurrentReading();

  // WebSocket
  ws.cleanupClients();
  if (!isWebConnected) {
    if (ahora - lastBlink > 500) {
      lastBlink = ahora;
      digitalWrite(LED_BUILTIN_PIN, !digitalRead(LED_BUILTIN_PIN));
    }
  } else if (ahora - lastWsSendTime > WS_SEND_INTERVAL) {
    lastWsSendTime = ahora;
    broadcastState();
  }

  updateLCD();
  debugSerial();

  delay(5);
}
